In [1]:
import pandas as pd

In [2]:
df = pd.read_csv('Demo.csv')
print(df)

              Name and Grant
0  Adam White - ES-1234-5678
1  Jack Jones - ES-2234-9876
2         Andy Law - EIP-111
3  Mike Miles - ES-2222-3333

In [3]:
print(df.columns)

Index(['Name and Grant'], dtype='object')

In [4]:
df['Name and Grant'].str.split(' - ')

0    [Adam White, ES-1234-5678]
1    [Jack Jones, ES-2234-9876]
2           [Andy Law, EIP-111]
3    [Mike Miles, ES-2222-3333]
Name: Name and Grant, dtype: object

In [5]:
df[['Name','Grant']] = df['Name and Grant'].str.split(' - ', expand=True)
df

              Name and Grant        Name         Grant
0  Adam White - ES-1234-5678  Adam White  ES-1234-5678
1  Jack Jones - ES-2234-9876  Jack Jones  ES-2234-9876
2         Andy Law - EIP-111    Andy Law       EIP-111
3  Mike Miles - ES-2222-3333  Mike Miles  ES-2222-3333

In [6]:
df[['First Name', 'Last Name']] = df['Name'].str.split(' ', expand = True)
df

              Name and Grant        Name         Grant First Name Last Name
0  Adam White - ES-1234-5678  Adam White  ES-1234-5678       Adam     White
1  Jack Jones - ES-2234-9876  Jack Jones  ES-2234-9876       Jack     Jones
2         Andy Law - EIP-111    Andy Law       EIP-111       Andy       Law
3  Mike Miles - ES-2222-3333  Mike Miles  ES-2222-3333       Mike     Miles

In [7]:
df['Payroll Name'] = df['Last Name'] + ', ' + df['First Name']
df

,Name and Grant,Name,Grant,First Name,Last Name,Payroll Name
0,Adam White - ES-1234-5678,Adam White,ES-1234-5678,Adam,White,"White, Adam"
1,Jack Jones - ES-2234-9876,Jack Jones,ES-2234-9876,Jack,Jones,"Jones, Jack"
2,Andy Law - EIP-111,Andy Law,EIP-111,Andy,Law,"Law, Andy"
3,Mike Miles - ES-2222-3333,Mike Miles,ES-2222-3333,Mike,Miles,"Miles, Mike"

In [8]:
df2 = pd.read_csv('HC.csv')
print(df2)

  Payroll Name  Home Department Code Home Department Description  \
0  White, Adam                  4001                    Platform
1  Jones, Jack                  5001                   Marketing
2  Miles, Mike                  4100                       Sales
3    Law, Andy                  4200                     Channel
4    Lin, Lily                  6001                          HR

  Location Description
0          Los Angeles
1             New York
2          Los Angeles
3             New York
4              Chicago

In [9]:
Left_join = pd.merge(df,
                    df2,
                    on = 'Payroll Name',
                    how = 'left')
Left_join

,Name and Grant,Name,Grant,First Name,Last Name,Payroll Name,Home Department Code,Home Department Description,Location Description
0,Adam White - ES-1234-5678,Adam White,ES-1234-5678,Adam,White,"White, Adam",4001,Platform,Los Angeles
1,Jack Jones - ES-2234-9876,Jack Jones,ES-2234-9876,Jack,Jones,"Jones, Jack",5001,Marketing,New York
2,Andy Law - EIP-111,Andy Law,EIP-111,Andy,Law,"Law, Andy",4200,Channel,New York
3,Mike Miles - ES-2222-3333,Mike Miles,ES-2222-3333,Mike,Miles,"Miles, Mike",4100,Sales,Los Angeles